# Titanic

Veri seti içerisinde yolcuların bilgileri yer almakta ve yolcuların hayatta kalıp kalmadığı bilgisi de bulunmaktadır. Bu veri seti üzerinde çeşitli analizler yaparak yolcuların hayatta kalma durumunu tahmin etmeye çalışacağız. Veriyi kaggle'dan aldık. İndirmek isterseniz [tıklayınız](https://www.kaggle.com/c/titanic/data)

1 - Veriyi Okuma

2 - Veriyi İnceleme

3 - Kullanabileceğimiz Feature'ları Belirleme

4 - EDA (Exploratory Data Analysis) Boş sütunları doldurma

5 - Dönüştürülebilecek object verileri int veya float verilere dönüştürme

6 - x ve y'yi belirleme (Regression ve Classification için x ve y belirlenir. Clustering'de sadece x belirlenir)

7 - Modelleme

In [368]:
import pandas as pd

In [370]:
df_train = pd.read_csv("ttrain.csv")
df_train['Source'] = "train"

df_test = pd.read_csv("ttest.csv")
df_test['Source'] = "test"

df = pd.concat([df_train, df_test])

In [402]:
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Source,Sex_male,Embarked_Q,Embarked_S,Title_Miss,Title_Mr,Title_Mrs
0,1,0.0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,train,True,False,True,False,True,False
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,train,False,False,False,False,False,True
2,3,1.0,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,train,False,False,True,True,False,False
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,train,False,False,True,False,False,True
4,5,0.0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,train,True,False,True,False,True,False

In [372]:
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
Source            0
dtype: int64

In [373]:
df.corr(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.038354,0.028814,-0.055224,0.008942,0.031428
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.038354,-0.338481,1.000000,-0.408106,0.060832,0.018322,-0.558629
Age,0.028814,-0.077221,-0.408106,1.000000,-0.243699,-0.150917,0.178740
SibSp,-0.055224,-0.035322,0.060832,-0.243699,1.000000,0.373587,0.160238
Parch,0.008942,0.081629,0.018322,-0.150917,0.373587,1.000000,0.221539
Fare,0.031428,0.257307,-0.558629,0.178740,0.160238,0.221539,1.000000

In [374]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1309.000000,891.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.383838,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.486592,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

In [375]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
 12  Source       1309 non-null   object
dtypes: float64(3), int64(4), object(6)
memory usage: 143.2+ KB

#### Feature Engineering

In [376]:
df['Age'].value_counts()

Age
24.0    47
22.0    43
21.0    41
30.0    40
18.0    39
        ..
23.5     1
70.5     1
55.5     1
20.5     1
38.5     1
Name: count, Length: 98, dtype: int64

In [377]:
df['Title'] = df['Name'].str.extract(' ([A-Za-z]+)\.')

In [378]:
df['Title'].value_counts()

Title
Mr          757
Miss        260
Mrs         197
Master       61
Rev           8
Dr            8
Col           4
Mlle          2
Major         2
Ms            2
Lady          1
Sir           1
Mme           1
Don           1
Capt          1
Countess      1
Jonkheer      1
Dona          1
Name: count, dtype: int64

In [379]:
df['Title'] = df['Title'].replace(['Ms', 'Mlle'], 'Miss')
df['Title'] = df['Title'].replace(['Mme', 'Countess', 'Lady', 'Dona'], 'Mrs')
df['Title'] = df['Title'].replace(['Capt', 'Col', 'Major', 'Sir', 'Dr', 'Don', 'Rev', 'Jonkheer'], 'Mr')

In [380]:
df['Title'].value_counts()

Title
Mr        783
Miss      264
Mrs       201
Master     61
Name: count, dtype: int64

In [381]:
df['Age'] = df['Age'].fillna(df.groupby('Title')['Age'].transform('mean'))

In [382]:
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age               0
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
Source            0
Title             0
dtype: int64

In [383]:
df['Fare'].value_counts()

Fare
8.0500     60
13.0000    59
7.7500     55
26.0000    50
7.8958     49
           ..
7.7417      1
8.1583      1
8.4583      1
7.8000      1
7.7208      1
Name: count, Length: 281, dtype: int64

In [384]:
df['Fare'] = df['Fare'].fillna(df['Fare'].mode()[0])

In [385]:
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age               0
SibSp             0
Parch             0
Ticket            0
Fare              0
Cabin          1014
Embarked          2
Source            0
Title             0
dtype: int64

In [386]:
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

In [387]:
df = pd.get_dummies(df, columns=['Sex', 'Embarked', 'Title'], drop_first=True)

In [388]:
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Age               0
SibSp             0
Parch             0
Ticket            0
Fare              0
Cabin          1014
Source            0
Sex_male          0
Embarked_Q        0
Embarked_S        0
Title_Miss        0
Title_Mr          0
Title_Mrs         0
dtype: int64

#### Train Test Split

In [389]:
train = df[df['Source'] == 'train'].drop(columns=['Source'])
test = df[df['Source'] == 'test'].drop(columns=['Survived', 'Name', 'Ticket', 'Cabin', 'PassengerId', 'Source'])

In [390]:
x = train.drop(['Survived', 'Name', 'Ticket', 'Cabin', 'PassengerId'], axis=1)
y = train[['Survived']]

#### Modelling

In [391]:
from sklearn.naive_bayes import GaussianNB, BernoulliNB
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import cross_val_score

In [392]:
gnb=GaussianNB()
bnb=BernoulliNB()
lr=LogisticRegression()
dt=DecisionTreeClassifier()
rf=RandomForestClassifier()
gbc=GradientBoostingClassifier()
knc=KNeighborsClassifier()

In [393]:
def algo_test(x, y):
    algo = [gnb, bnb, lr, dt, rf, gbc, knc]
    algo_name = ['GaussianNB', 'BernoulliNB', 'LogisticRegression', 'DecisionTreeClassifier', 'RandomForestClassifier', 'GradientBoostingClassifier', 'KNeighborsClassifier']
    score_list = []
    for i in algo:
        if isinstance(y, pd.DataFrame):
            score = cross_val_score(i, x, y.values.ravel(), cv=10, scoring='accuracy').mean()
        else:
            score = cross_val_score(i, x, y, cv=10, scoring='accuracy').mean()
        score_list.append(score)
    return pd.DataFrame(data=score_list, index=algo_name, columns=['Score']).sort_values(by='Score', ascending=False)

In [394]:
algo_test(x, y)

                               Score
GradientBoostingClassifier  0.833908
LogisticRegression          0.826030
RandomForestClassifier      0.813745
GaussianNB                  0.790112
DecisionTreeClassifier      0.787953
BernoulliNB                 0.785655
KNeighborsClassifier        0.713883

In [395]:
df_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Source
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,test
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,test
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,test
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,test
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,test
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,test
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,test
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,test
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,test
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,test

#### Prediction

In [397]:
gbc.fit(x, y)
pred = gbc.predict(test)

In [398]:
sbm_df = pd.DataFrame({'PassengerId': df_test.PassengerId, 'Survived': pred})
sbm_df['Survived'] = sbm_df['Survived'].astype('int64')

In [399]:
sbm_df.to_csv('submission.csv', index=False)

In [400]:
sbm_df.sample(20)

     PassengerId  Survived
374         1266         1
294         1186         0
91           983         0
137         1029         0
69           961         1
200         1092         1
29           921         0
238         1130         1
321         1213         0
214         1106         1
298         1190         0
47           939         0
4            896         1
387         1279         0
386         1278         0
27           919         0
50           942         0
399         1291         0
210         1102         0
359         1251         0